{
  "home": "Home",
  "advantage": "Advantage",
  "history": "History",
  "route_map": "Route map",
  "world_first": "The world’s first",
  "based_on_ipfs": "InterPlanetary video public chain based on 'IPFS' application",
  "about_fsv": "ABOUT FSV",
  "paragraph1": "FSV (File System Video), a decentralized video file system based on the blockchain, can transmit data based on GOSSIP protocol. FSV aims to provide a decentralized blockchain video publishing environment for video producers, cast streaming media copyrights with NFT technology, realize governance through DPOS mechanism, and create a new ecology for on-chain economy in the field of streaming media industry. FSV provides a decentralized copyright registration and trading platform to fix the copyrighter according to the registration timestamp, generate the NFT blockchain copyright certificate, achieve self-governance through the decentralized DPOS mechanism, solve the problems in the field of global streaming media copyright, and promote the full protection of the interests at all aspects in the streaming media industry.",
  "innovation": "INNOVATION",
  "streaming_media_ecosystem": "Streaming media ecosystem",
  "technological_progress": "Technological progress",
  "paragraph2": "As a long-term sustainable incentive mechanism, FSV encourages all stakeholders to participate in video delivery, which is completely decentralized.",
  "paragraph3": "FSV is the only end-to-end platform, new blockchain, next generation peer-to-peer architecture.",
  "paragraph4": "A new generation of native blockchain created for decentralized video transmission technology.",
  "paragraph5": "Multi-level BFT consensus mechanism, aggregated signature Gossip scheme, resource-oriented micro-payment pool and other innovative technologies.",
  "paragraph6": "IPFS-equivalent distributed storage technology with three main features: semantic web, strong distribution, and micro storage. Specifically, divide a single video file into several 256KB fragments, store multiple fragments and multiple nodes, sort them by distance from the nearest node, and get the desired fragments.",
  "overview_of_fsv": "OVERVIEW OF FSV TECHNICAL CHARACTERISTICS",
  "ipfs_distributed_storage_underlying_technology": "IPFS distributed storage underlying technology",
  "overview1": "FSV adopts the IPFS distributed storage underlying technology to divide the video resources into fragments of 256KB or less and encrypt them to generate garbled codes and store them in different bandwidths and hard drives.",
  "nft_copyright_casting_technology": "NFT copyright casting technology",
  "overview2": "NFT is also known as non-homogeneous token. Each NFT has a unique identity which is not interchangeable. Casting copyright with NFT technology is allowed to register the copyrights of the resource publishers on the FSV chain through decentralized technology, permanently protect their rights and interests, and solve various conflicts related to off-chain copyright.",
  "route_penetration_technology": "Route penetration technology",
  "overview3": "This technology enables the server of the IPFS network to be both a server and a client, namely, serving as a client when downloading and watching videos, while serving as a server when providing storage for video resources. The more servers there are, the faster the download speed. This technology truly achieves a high degree of end-to-end decentralization.",
  "cdn_acceleration_technology": "CDN acceleration technology",
  "overview4": "It solves the problem of nearby access to video resources. Specifically, it enables users to follow the principle of nearby distribution when retrieving and downloading video resources, greatly improving access efficiency.",
  "introduction_to_fsv_application_scenarios": "INTRODUCTION TO FSV APPLICATION SCENARIOS",
  "application1": "Fix the copyrighter with blockchain technology",
  "application2": "Fragment and encrypt video resources, and generate garbled codes and store them on the chain",
  "application3": "Build a fairer encrypted video sharing platform community",
  "application4": "Convert the hash address of the content into a text title for quick access",
  "application5": "Distributed log search engine, allowing users to quickly retrieve",
  "application6": "Upload video files to the IPFS network more efficiently and conveniently",
  "application7": "Solve a series of problems in streaming media with blockchain technology, such as piracy, plagiarism, manuscript laundering, sensational headline writer, and low-quality content",
  "application8": "Sweep code under the chain while making payment on the chain",
  "history_title": "HISTORY",
  "history1": "the US NEPTUNE Foundation was formally established. It was composed of top talents in the industry, such as members of the International Intellectual Property Alliance, core members of the distributed storage property research laboratory, and developers of Silicon Valley research laboratory.",
  "history2": "video preview and video acceleration technology was published",
  "history3": "the video fragmenting, storage and transmission protocol was optimized.",
  "history4": "the US NEPTUNE and Blinkx jointly established the FSV InterPlanetary Video Lab to develop the FSV public chain.",
  "history5": "route penetration technology was published.",
  "history6": "the FSV testnet was launched.",
  "partnership": "PARTNERSHIP",
  "route_map_title": "ROUTE MAP",
  "map1_title": "April to June 2020",
  "map11": "Added a new interface to copyright revenue collection list",
  "map12": "Recreated tx task; updated readme",
  "map13": "Some interface to copyright dispute and copyright pledge",
  "map14": "Added all_links command",
  "map15": "Functions of p2p download and database saving",
  "map16": "Improved the main startup code and gomod dependency",
  "map2_title": "July to October 2020",
  "map21": "Restored video encryption cipher suite padding",
  "map22": "Distinguished local saved、on-chain names when uploading",
  "map23": "Refactored file handling when uploading files",
  "map24": "Added a new transfer search",
  "map25": "Added a new interface for password modification",
  "map3_title": "November to December 2020",
  "map31": "ipfs function development  / Opened the ipfs interface",
  "map32": "Started the crawler and ipfs service separately Added: Delete completed tasks / ipfs test write-in delete",
  "map33": "Error information addition and bug modification",
  "map4_title": "January to March 2021",
  "map41": "Downloaded the original version 0.5.0 and 0.7.0 from Github",
  "map42": "ipfs unblocked the address monitoring of 10 and 172 network segments",
  "map43": "Modified IpfsGateway port number 8080 to 11808",
  "map44": "Restored the quic-go version; removed the 10ip limit",
  "map45": "Merged IPFS 0.5.0--->0.8.0 nat code",
  "map5_title": "April to May 2021",
  "map51": "Restored the quic-go version",
  "map52": "removed the 10ip limit",
  "map53": "ipfs unblock the address monitoring of 10 and 172 network segments",
  "map54": "Modified IpfsGateway port number 8080 to 11808",
  "map6_title": "June to July 2021",
  "map61": "Updated the default startup command prompt of ipfs",
  "map62": "Added swarmContributes command、interface for swarm",
  "map63": "Added an interface to view the contribution list for ipfs http client",
  "map64": "Fix the flash back problem of AddrInfo->MarshalJSON",
  "map65": "Added IsPinned interface of ipfs pin module",
  "open_source_community": "open source community",
  "download_white_paper": "Download white paper",
  "help": "Help",
  "newbie_help": "Newbie Help",
  "privacy_policy": "PRIVACY POLICY",
  "api_file": "API File",
  "terms": "Terms",
  "user_agreement": "User Agreement",
  "disclaimer": "Disclaimer",
  "privacy_clause": "Privacy Clause",
  "about_us_footer": "About Us",
  "contact_us": "Contact Us",
  "join_us": "Join Us",
  "dianbao": "",
  "community": "Community",
  "(twitter)": "(Twitter)",
  "下载PC客户端": "Download PC Client",
  "下载链接1": "Download Link 1",
  "下载链接2": "Download Link 2",
  "下载链接3": "Download Link 3",
  "下载APP": "Download APP"
}