{
  "首页": "Home",
  "优势": "Advantage",
  "发展轨迹": "History",
  "路线图": "Route map",
  "全球首家": "The world’s first",
  "基于「 IPFS 」应用的星际视频公链": "InterPlanetary video public chain based on 'IPFS' application",
  "关于FSV": "ABOUT FSV",
  "FSV （File System Video）是一个基于区块链的去中心化的视频文件系统，基于GOSSIP协议进行数据传输。FSV旨在为视频生成者提供一个去中心化的区块链视频发布环境，运用NFT技术铸造流媒体版权，通过DPOS机制进行治理，打造流媒体产业领域的链上经济新生态。": "FSV (File System Video), a decentralized video file system based on the blockchain, can transmit data based on GOSSIP protocol. FSV aims to provide a decentralized blockchain video publishing environment for video producers, cast streaming media copyrights with NFT technology, realize governance through DPOS mechanism, and create a new ecology for on-chain economy in the field of streaming media industry. ",
  "FSV提供去中心化的版权注册、交易平台，按照注册时间戳固定版权所有人，并生成NFT区块链版权证书，通过去中心化的DPOS机制进行自我治理，解决全球流媒体版权领域中存在的各种问题，促使流媒体产业领域中各个环节的利益得以充分保障。": "FSV provides a decentralized copyright registration and trading platform to fix the copyrighter according to the registration timestamp, generate the NFT blockchain copyright certificate, achieve self-governance through the decentralized DPOS mechanism, solve the problems in the field of global streaming media copyright, and promote the full protection of the interests at all aspects in the streaming media industry.",
  "创新之处": "INNOVATION",
  "流媒体生态系统": "Streaming media ecosystem",
  "技术进步": "Technological progress",
  "FSV作为一个长期可持续的激励机制，激励所有利益相关者参与视频交付，完全分散。": "As a long-term sustainable incentive mechanism, FSV encourages all stakeholders to participate in video delivery, which is completely decentralized.",
  "FSV是唯一的端到端平台，新的区块链，下一代点对点架构。": "FSV is the only end-to-end platform, new blockchain, next generation peer-to-peer architecture.",
  "为分散式视频传输技术创建的新一代原生区块链": "A new generation of native blockchain created for decentralized video transmission technology.",
  "多层的BFT作为共识机制，聚合签名的Gossip协议（Aggregated Signature Gossip Scheme）面向资源的微支付池等创新技术": "Multi-level BFT consensus mechanism, aggregated signature Gossip scheme, resource-oriented micro-payment pool and other innovative technologies.",
  "运用了IPFS同等的分布式存储技术，主要有语义网、强分发、微存储三个特点。把单个视频文件拆分成若干个256KB的分片，多片段多节点存储，从最近节点中按照距离进行排序，获取想要的分片": "IPFS-equivalent distributed storage technology with three main features: semantic web, strong distribution, and micro storage. Specifically, divide a single video file into several 256KB fragments, store multiple fragments and multiple nodes, sort them by distance from the nearest node, and get the desired fragments.",
  "FSV技术特征简介": "OVERVIEW OF FSV TECHNICAL CHARACTERISTICS",
  "IPFS分布式存储底层技术": "IPFS distributed storage underlying technology",
  "FSV采用了IPFS分布式存储底层技术，将视频资源切割分片为256KB以下并加密生成乱码存储在不同带宽和硬盘中。": "FSV adopts the IPFS distributed storage underlying technology to divide the video resources into fragments of 256KB or less and encrypt them to generate garbled codes and store them in different bandwidths and hard drives.",
  "NFT版权铸造技术": "NFT copyright casting technology",
  "NFT又称非同质化代币，每个NFT拥有唯一的身份标识，且不可互换，使用NFT技术铸造版权，可使资源发布者的版权通过去中心化技术在FSV链上确权，永久保障其权益，解决链下版权的各种矛盾。": "NFT is also known as non-homogeneous token. Each NFT has a unique identity which is not interchangeable. Casting copyright with NFT technology is allowed to register the copyrights of the resource publishers on the FSV chain through decentralized technology, permanently protect their rights and interests, and solve various conflicts related to off-chain copyright.",
  "路由穿透技术": "Route penetration technology",
  "该技术可使IPFS网络的服务器既是服务端又是客户端，下载观看视频时为客户端，提供视频资源存储时为服务端，而且服务 器越多下载速度越快，真正实现端对端的高度去中心化。": "This technology enables the server of the IPFS network to be both a server and a client, namely, serving as a client when downloading and watching videos, while serving as a server when providing storage for video resources. The more servers there are, the faster the download speed. This technology truly achieves a high degree of end-to-end decentralization.",
  "CDN加速技术": "CDN acceleration technology",
  "解决了视频资源就近访问的问题，它可以使得用户检索下载视频资源时遵循就近分发原则，极大的提高了访问效率。": "It solves the problem of nearby access to video resources. Specifically, it enables users to follow the principle of nearby distribution when retrieving and downloading video resources, greatly improving access efficiency.",
  "FSV应用场景简介": "INTRODUCTION TO FSV APPLICATION SCENARIOS",
  "用区块链技术 ，固定版权所有人": "Fix the copyrighter with blockchain technology",
  "视频资源分片加密，生成乱码上链存储": "Fragment and encrypt video resources, and generate garbled codes and store them on the chain",
  "建立更公平的加密视频分享平台社区": "Build a fairer encrypted video sharing platform community",
  "内容的哈希地址转化为文字标题，快速访问": "Convert the hash address of the content into a text title for quick access",
  "分布式日志搜索引擎，可以让用户快速检索": "Distributed log search engine, allowing users to quickly retrieve",
  "更有效便捷的将视频文件上传至IPFS网络": "Upload video files to the IPFS network more efficiently and conveniently",
  "用区块链技术解决流媒体的盗版、抄袭、洗稿、标题党、低质量内容等一系列问题": "Solve a series of problems in streaming media with blockchain technology, such as piracy, plagiarism, manuscript laundering, sensational headline writer, and low-quality content",
  "链下扫码 ，链上支付": "Sweep code under the chain while making payment on the chain",
  "发展轨迹标题": "HISTORY",
  "US NEPTUNE基金会正式成立，由美国知识产权联盟会员，分布式存储产权研究实验室核心成员、硅谷研究实验室开发者等行业顶尖人才组成。": "the US NEPTUNE Foundation was formally established. It was composed of top talents in the industry, such as members of the International Intellectual Property Alliance, core members of the distributed storage property research laboratory, and developers of Silicon Valley research laboratory.",
  "公布视频预览与视频加速技术": "video preview and video acceleration technology was published",
  "优化视频分片存储传输协议": "the video fragmenting, storage and transmission protocol was optimized.",
  "US NEPTUNE基金会，Blinkx在线视频，共同联合成立FSV星际视频实验室，开发FSV公链。": "the US NEPTUNE and Blinkx jointly established the FSV InterPlanetary Video Lab to develop the FSV public chain.",
  "公布路由穿透技术": "route penetration technology was published.",
  "FSV测试网上线": "the FSV testnet was launched.",
  "合作伙伴": "PARTNERSHIP",
  "路线图标题": "ROUTE MAP",
  "2020年4—6月": "April to June 2020",
  "新增版权收益领取列表接口": "Added a new interface to copyright revenue collection list",
  "重做tx task；更新readme": "Recreated tx task; updated readme",
  "版权纠纷和版权质押部分接口": "Some interface to copyright dispute and copyright pledge",
  "增加 all_links命令": "Added all_links command",
  "p2p下载，保存数据库功能": "Functions of p2p download and database saving",
  "完善main启动代码和 gomod依赖": "Improved the main startup code and gomod dependency",
  "2020年7—10月": "July to October 2020",
  "修复视频加密密码组padding": "Restored video encryption cipher suite padding",
  "文件上传时区分本地存储和链上名称": "Distinguished local saved、on-chain names when uploading",
  "重构上传文件时的文件处理": "Refactored file handling when uploading files",
  "新增转账搜索": "Added a new transfer search",
  "新增修改密码接口": "Added a new interface for password modification",
  "2020年11—12月": "November to December 2020",
  "ipfs 功能开发  / 开启ipfs接口": "ipfs function development  / Opened the ipfs interface",
  "单独启动爬虫及ipfs服务 / 新增：删除完成的任务": "Started the crawler and ipfs service separately Added: Delete completed tasks / ipfs test write-in delete",
  "ipfs测试写入删除  / 错误信息添加及bug修改": "Error information addition and bug modification",
  "2021年1—3月": "January to March 2021",
  "从Github下载原始版本0.5.0和0.7.0": "Downloaded the original version 0.5.0 and 0.7.0 from Github",
  "ipfs取消屏蔽10和172网段的地址监听": "ipfs unblocked the address monitoring of 10 and 172 network segments",
  "还原quic-go版本；去掉10ip限制": "Restored the quic-go version; removed the 10ip limit",
  "IPFS 0.5.0--->0.8.0 nat代码合并": "Merged IPFS 0.5.0--->0.8.0 nat code",
  "2021年4—5月": "April to May 2021",
  "还原quic-go版本": "Restored the quic-go version",
  "去掉10ip限制": "removed the 10ip limit",
  "ipfs取消屏蔽10和172网段的地址监听 ": "ipfs unblock the address monitoring of 10 and 172 network segments",
  "修改IpfsGateway端口号8080为11808": "Modified IpfsGateway port number 8080 to 11808",
  "2021年6—7月": "June to July 2021",
  "更新ipfs默认启动命令提示": "Updated the default startup command prompt of ipfs",
  "swarm 增加swarmContributes命令和接口": "Added swarmContributes command、interface for swarm",
  "ipfs http client增加查看贡献名单的接口": "Added an interface to view the contribution list for ipfs http client",
  "修复AddrInfo->MarshalJSON的闪退问题": "Fix the flash back problem of AddrInfo->MarshalJSON",
  "ipfs pin模块 增加IsPinned的接口": "Added IsPinned interface of ipfs pin module",
  "FSV开源社区": "open source community",
  "下载白皮书": "Download white paper",
  "帮助中心": "Help",
  "新手帮助": "Newbie Help",
  "隐私政策": "PRIVACY POLICY",
  "API文档": "API File",
  "条款说明": "Terms",
  "用户协议": "User Agreement",
  "免责申明": "Disclaimer",
  "隐私条款": "Privacy Clause",
  "关于我们": "About Us",
  "联系我们": "Contact Us",
  "加入我们": "Join Us",
  "社区": "Community",
  "电报群": "Telegraphs",
  "推特": "Twitter",
  "下载PC客户端": "Download PC Client",
  "下载Linux客户端": "Download Linux Client",
  "下载链接1": "Download Link 1",
  "下载链接2": "Download Link 2",
  "下载链接3": "Download Link 3",
  "下载APP": "Download APP",
  "下载app": "Download the app",
  "美国": "U.S.A",
  "欧洲": "Europe",
  "中国": "China",
  "美洲": "America",
  "亚洲": "Asia",
  "下载客户端": "Download client",
  "双挖": "Double excavation",
  "奇亚双挖(windows版)": "Chia Double excavation(windows)",
  "如何在奇亚矿机上进行一机双挖": "How to carry out one machine double excavation on Chia mining machine",
  "DPoS 教程": "DPoS tutorial"
}